Revit 2026 API

# PulldownButtonData Constructor

---

Constructs a new instance of PulldownButtonData.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PulldownButtonData(
	string name,
	string text
)
```
```vb
Public Sub New (
	name As String,
	text As String
)
```
```cpp
public:
PulldownButtonData(
	String^ name,
	String^ text
)
```
```fsharp
new :
        name : string *
        text : string -> PulldownButtonData
```

#### Parameters

name String
    The internal name of the new button.
text String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for one or more arguments. |
| ArgumentException | Thrown when an empty string is passed for one or more arguments. |

#### Reference

PulldownButtonData Class

Autodesk.Revit.UI Namespace